app/views/orders/index.html.erb

    <ul>
      <% order.line_items.each do |item| %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1  [["order_id", 1]]