app/views/orders/new.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 1]]
---
<div class="order-form">
<% @current_cart.line_items.each do |line_item| %>