app/views/carts/show.html.erb

  <div class="flex">
          <% @cart.line_items.each do |line_item| %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 1]]