app/views/items/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
      <div class="description">
        <% if @item.user.present? %>