app/controllers/application_controller.rb

  def fetch_user
    @current_user = User.find_by :id => session[:user_id] if session[:user_id].present?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]

  def current_cart
    if session[:cart_id] #If a session[:cart_id] already exists then find the Cart with that id, if there is no cart with that id then set the session id to nil.
      cart = Cart.find_by :id => session[:cart_id]
        if cart.present?
          @current_cart = cart
        else
          session[:cart_id] = nil
        end
    end
      if session[:cart_id] == nil
        # If there is no session[:cart_id] associated with this user then create a new cart and store it in the users session id
        @current_cart = Cart.create
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-10-25 21:37:09.813152"], ["updated_at", "2021-10-25 21:37:09.813152"]]