app/controllers/carts_controller.rb

  def destroy
    # empty the cart
    @cart = @current_cart
    @cart.destroy
---
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 17]]