app/controllers/items_controller.rb

  def index
    @items = Item.all #fetch all items from the database:
---
SELECT "items".* FROM "items"

  def edit
    @item = Item.find params[:id]
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]

  def show
    # The show action calls item.find  with the ID captured by the route parameter.
    # The returned item is stored in the @item instance variable, so it is accessible by the view
    @item = Item.find params[:id]
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]