app/controllers/line_items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
INSERT INTO "line_items" ("item_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["item_id", 19], ["cart_id", 1], ["created_at", "2021-10-25 22:47:12.072032"], ["updated_at", "2021-10-25 22:47:12.072032"]]
---
  def create
    #find the associated item and current cart
    chosen_item = Item.find(params[:item_id])#find the item by id
    current_cart = @current_cart # store the current cart
    @line_item = LineItem.new #create a new line item
      @line_item.cart = current_cart
      @line_item.item = chosen_item
      # Save and redirect to cart show path
    @line_item.save