app/controllers/orders_controller.rb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 1]]
INSERT INTO "orders" ("name", "email", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "gem"], ["email", "ff@ga"], ["address", "aa"], ["created_at", "2021-10-25 23:00:02.984581"], ["updated_at", "2021-10-25 23:00:02.984581"]]
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 1]]
---
  def create
    @order = Order.new order_params
    @current_cart.line_items.each do |item|
      @order.line_items << item #append each item as line item in the order
      item.cart_id = nil
    end
    @order.save
    Cart.destroy session[:cart_id]

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @order = Order.find params[:id]