app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "fkf@ga"], ["LIMIT", 1]]
---
  def create
    # 1. Check if the email address entered is actually in the DB
    user = User.find_by :email => params[:email]